In [28]:
import pandas as pd

In [29]:
index = 'a b c'.split()

In [30]:
row = [[1,2,3],[4,5,6],[7,8,9]]

In [31]:
columns = 'sales1 sales2 sales3'.split()

In [32]:
df = pd.DataFrame(row, index, columns)

In [33]:
df

   sales1  sales2  sales3
a       1       2       3
b       4       5       6
c       7       8       9

In [34]:
df['days'] = ['day1', 'day2', 'day3']
df

   sales1  sales2  sales3  days
a       1       2       3  day1
b       4       5       6  day2
c       7       8       9  day3

In [35]:
df.set_index('days')

      sales1  sales2  sales3
days
day1       1       2       3
day2       4       5       6
day3       7       8       9